In [20]:
import pandas as pd
df = pd.read_csv('db.csv', delimiter=';')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6341 entries, 0 to 6340
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   pickup           6341 non-null   object
 1   dropoff          6341 non-null   object
 2   passengers       6341 non-null   int64
 3   distance         6341 non-null   float64
 4   fare             6341 non-null   float64
 5   tip              6341 non-null   float64
 6   tolls            6341 non-null   float64
 7   total            6341 non-null   float64
 8   color            6341 non-null   object
 9   payment          6341 non-null   object
 10  pickup_zone      6341 non-null   object
 11  dropoff_zone     6341 non-null   object
 12  pickup_borough   6341 non-null   object
 13  dropoff_borough  6341 non-null   object
dtypes: float64(5), int64(1), object(8)
memory usage: 693.7+ KB

In [21]:
df['time'] = pd.to_datetime(df['dropoff']) - pd.to_datetime(df['pickup'])
df.describe()['time']['max'].total_seconds()

In [28]:
df.describe()

,passengers,distance,fare,tip,tolls,total,time
count,6341.000000,6341.000000,6341.000000,6341.000000,6341.000000,6341.000000,6341
mean,1.544078,2.997707,12.887931,1.972703,0.314793,18.310263,0 days 00:14:20.950954108
std,1.207948,3.719775,10.722249,2.361897,1.369174,12.950365,0 days 00:11:31.405022633
min,0.000000,0.000000,1.000000,0.000000,0.000000,1.300000,0 days 00:00:03
25%,1.000000,0.990000,6.500000,0.000000,0.000000,10.800000,0 days 00:06:32
50%,1.000000,1.650000,9.500000,1.750000,0.000000,14.160000,0 days 00:10:56
75%,2.000000,3.200000,15.000000,2.820000,0.000000,20.300000,0 days 00:18:29
max,6.000000,36.700000,150.000000,23.190000,24.020000,174.820000,0 days 01:47:40

In [27]:
df.describe()['time']['max'].total_seconds()

6460.0

In [5]:
df['pickup_zone'].value_counts()

pickup_zone
Midtown Center                  227
Penn Station/Madison Sq West    209
Upper East Side South           208
Clinton East                    208
Midtown East                    196
                               ...
Highbridge Park                   1
Brighton Beach                    1
Bronx Park                        1
Crotona Park East                 1
Hillcrest/Pomonok                 1
Name: count, Length: 194, dtype: int64

In [6]:
df[df['payment'] == 'credit card'].describe()

,passengers,distance,fare,tip,tolls,total
count,4546.000000,4546.000000,4546.000000,4546.000000,4546.000000,4546.000000
mean,1.540695,3.209327,13.531098,2.751630,0.371067,19.877288
std,1.219115,3.890197,11.100915,2.374438,1.450619,13.522908
min,0.000000,0.000000,2.500000,0.000000,0.000000,3.300000
25%,1.000000,1.010000,6.500000,1.500000,0.000000,11.760000
50%,1.000000,1.730000,9.500000,2.200000,0.000000,15.350000
75%,2.000000,3.477500,15.500000,3.260000,0.000000,21.960000
max,6.000000,30.230000,93.500000,23.190000,17.280000,100.490000

1 задача

Назовите совокупную сумму чаевых топ-5 поездок,
где пассажиры оказались щедрыми на чаевые
(в абсолютных значениях, результат округлите до целых).

В ответе введите число цифрами и символ без проблема

In [7]:
sum_5_tip = df.sort_values('tip', ascending=False)[:5]
sum_5_tip

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough
4162,2019-03-29 17:32:20,2019-03-29 18:53:52,1,26.92,75.50,23.19,0.00,100.49,yellow,credit card,JFK Airport,Cobble Hill,Queens,Brooklyn
2351,2019-03-28 15:58:52,2019-03-28 15:59:25,1,1.80,69.06,20.80,0.00,90.16,yellow,credit card,JFK Airport,JFK Airport,Queens,Queens
772,2019-03-15 15:10:03,2019-03-15 16:25:25,1,16.30,52.00,18.30,5.76,79.36,yellow,credit card,Murray Hill,JFK Airport,Manhattan,Queens
1461,2019-03-10 20:27:25,2019-03-10 20:28:33,1,0.00,52.00,16.59,0.00,71.89,yellow,credit card,Lincoln Square East,Lincoln Square East,Manhattan,Manhattan
4209,2019-03-27 18:08:31,2019-03-27 19:01:45,1,16.77,52.00,16.39,5.76,81.95,yellow,credit card,JFK Airport,East Village,Queens,Manhattan

In [8]:
18.30 + 23.19 + 20.80 + 16.59 + 16.39

95.27000000000001

In [9]:
sum_5_tip.sum()['tip']

95.27000000000001

In [17]:
print(round(sum_5_tip.sum()['tip']),'$', sep='')

95$

2 задача

Какова доля пошлин (tolls) в общем объеме рынка (total)
такси Нью-Йорка (в рамках представленного датасета)?
Ответ отразите в %, округлив результат до сотых

вводите ответ числом без пробелов между символами.

In [57]:
df['procent'] = df['tolls'] / df['total']

In [58]:
df.head()

,pickup,dropoff,passengers,distance,fare,tip,tolls,total,color,payment,pickup_zone,dropoff_zone,pickup_borough,dropoff_borough,procent
0,2019-03-23 20:21:09,2019-03-23 20:27:24,1,1.60,7.0,2.15,0.0,12.95,yellow,credit card,Lenox Hill West,UN/Turtle Bay South,Manhattan,Manhattan,0.0
1,2019-03-04 16:11:55,2019-03-04 16:19:00,1,0.79,5.0,0.00,0.0,9.30,yellow,cash,Upper West Side South,Upper West Side South,Manhattan,Manhattan,0.0
2,2019-03-27 17:53:01,2019-03-27 18:00:25,1,1.37,7.5,2.36,0.0,14.16,yellow,credit card,Alphabet City,West Village,Manhattan,Manhattan,0.0
3,2019-03-10 01:23:59,2019-03-10 01:49:51,1,7.70,27.0,6.15,0.0,36.95,yellow,credit card,Hudson Sq,Yorkville West,Manhattan,Manhattan,0.0
4,2019-03-30 13:27:42,2019-03-30 13:37:14,3,2.16,9.0,1.10,0.0,13.40,yellow,credit card,Midtown East,Yorkville West,Manhattan,Manhattan,0.0

In [61]:
df.sum()['tolls']/df.sum()['total'] * 100

1.7192140450339164

In [62]:
round(df.sum()['tolls']/df.sum()['total'] * 100, 2)

1.72

3


Кто больше (в среднем) оставляет чаевых:
те, кто расплачиваются за поездки банковскими картами,
или те, кто расплачивается наличными?
Выберете один из двух вариантов ответа: банковскими картами или наличными

В поле ответа введите словами (в именительном падеже) один из двух выделенных жирных шрифтом вариантов

In [23]:
df.groupby('payment').agg({'tip': 'mean'})

                 tip
payment
cash         0.00000
credit card  2.75163

4 
Сколько секунд заняла самая длинная поездка?

Введите в ответе только число цифрами

In [48]:
df['time'] = pd.to_datetime(df['dropoff']) - pd.to_datetime(df['pickup'])
df[df['distance'] == df['distance'].max()]['time']

5286   0 days 01:04:51
Name: time, dtype: timedelta64[ns]

In [63]:
3600 + 240 + 51

3891

In [ ]:
df[df['distance'] == df['distance'].max()]['time'].iloc[0].total_seconds()

In [ ]:
3891.0

5

Поездки из какого аэропорта в среднем дороже?

Ответ введите английскими буквами по следующей схеме: буквенное обозначение названия аэропорта + "Airport"

In [60]:
df[df['pickup_zone'].str.contains('Airport')]['pickup_zone'].value_counts()

pickup_zone
LaGuardia Airport    143
JFK Airport          142
Name: count, dtype: int64

In [59]:
df[df['pickup_zone'].str.contains('Airport')].groupby('pickup_zone').agg({'total': 'mean'}).sort_values('total')

                       total
pickup_zone
LaGuardia Airport  41.965734
JFK Airport        55.499296